#apps/questions.py
questions = [
"나는 운동으로 건강이 좋아지는 것을 경험했기 때문에 운동을 하려고 한다. ",
"나는 운동으로 불안, 걱정과 같은 부정적 생각이 없어지기 때문에 운동을 하려고 한다.", 
"나는 운동으로 삶에 활력을 얻기 때문에 운동을 하려고 한다.",
"나는 노후에 아플까봐 걱정되어 운동을 하려고 한다. ",
"내가 사는 날 동안 마음대로 움직일 수 있기를 원하기 때문에 운동을 하려고 한다. ",
"나는 젊어지고 예쁘게 나이들고 싶어서 운동을 하려고 한다. ",
"나는 노후에 자녀에게 부담이 되고 싶지 않기 때문에 운동을 하려고 한다. ",
"나는 가족을 돌봐야 하는 책임감이 있기 때문에 운동을 하려고 한다. ",
"나는 집에서도 얼마든지 스트레칭과 같은 신체활동을 할 수 있다고 생각한다.",
"나는 개인적 성취감이 들기 때문에 운동을 하게 된다. ",
"나는 집안일은 즐겁지 않으니까 운동이 아닌 노동이라고 생각한다. ",
"나는 사람들과 같이 신체활동을 하면서 인간관계도 쌓을 수 있다고 생각한다. ",
"내 의지가 없으면 운동은 할 수 없는 거라고 생각한다. ",
"나는 일상에서도 할 수 있는 신체활동을 시도해 본다. ",
"나는 습관이 되었기 때문에 힘들지 않게 운동을 하고 있다.",
"나는 삶의 즐거움을 위해 여가 활동을 한다. ",
"나는 운동을 내 몸에 습관화하기 위해 노력하는 중이다. ",
"나는 열심히 하는 성격이어서 운동도 꾸준히 하고 있다.",
"신체활동은 내 생활을 변화시켰기 때문에 나에게는 새로운 경험이었다.",
"신체활동을 하면 기분전환이 된다. ",
"나는 운동을 하면서 신체활동에 대한 자신감이 생겼다. ",
"나는 하루 일과에서 운동하는 시간이 설레이며 기대가 된다. ",
"객관적 자료(검사 결과 등)를 보면 운동에 도움이 된다. ",
"나는 활동적인 성격이기 때문에 신체활동을 좋아한다. ",
"나는 새로운 것에 흥미가 있기 때문에 여러 신체활동을 해보고 싶다. ",
"나는 운동하다가 다칠까봐 염려되어 운동을 하기가 두렵다. ",
"나는 같이 운동할 사람(가족, 배우자, 친구)이 없어서 안 하게 된다. ",
"나는 운동하고 싶은 의욕이 없다. ",
"집 가까이 운동할 수 있는 장소, 시설이 운동에 도움이 된다. ",
"나는 칭찬을 받으면 운동을 더 잘 하게 된다. ",
"나는 전문가의 자세 교정과 같은 피드백을 받으면 운동에 도움이 된다. ",
"나는 신체적 접촉과 같은 부담이 없는 운동이 좋다.",
"나는 주변 사람의 지지와 격려가 운동에 도움이 된다." ,
"나는 혼자하는 개인 운동보다 프로그램에 등록하여야 운동을 더 잘 하게 된다. ",
"나는 내게 맞는 운동을 하는 것이 중요하다고 생각한다.",
"운동이 주는 효과를 알고 운동하는 것이 중요하다. ",
"운동은 많이 하는 것보다 정확하게 하는 것이 더 중요하다. ",
"운동 프로그램에 대한 정보가 없어 운동하기 힘들다." 
]

choices = ["-3", "-2", "-1", "0", "1", "2", "3"]

"""
type1 : 효과지향 자기주도형, 
type2 : 동기중심 준비형, 
type3 : 정서중심 활력형, 
type4 : 생활기반 의무형 
9 18 20 21 29 31 32 37 
"""

